export default function Sidebar() {

  const menuItems = [
    "الرئيسية",
    "لوحة التحكم",
    "المزارع",
    "الحقول",
    "المحاصيل",
    "الري",
    "الأسمدة",
    "المبيدات",
    "الأمراض",
    "الطقس",
    "الخريطة",
    "المصاريف",
    "التقارير",
    "الذكاء الاصطناعي",
    "المهندس الزراعي",
    "المستخدمون",
    "الإعدادات",
  ];

  return (
    <aside>

      <h2>
        🌱 Smart Farm
      </h2>

      <ul>

        {menuItems.map((item) => (

          <li key={item}>
            {item}
          </li>

        ))}

      </ul>

    </aside>
  );

}
